archived_old_versions/gaganyaan_openfoam_staged_research_v2/gaganyaan_openfoam_staged_research_v2/cases/03_main_reef1/system/controlDict
FoamFile
{
    version 2.0; format ascii; class dictionary; object controlDict;
}
application     foamRun;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         800;
deltaT          1;
writeControl    timeStep;
writeInterval   200;
purgeWrite      0;
writeFormat     ascii;
writePrecision  8;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable true;

functions
{
    forceCoeffs_canopy
    {
        type            forceCoeffs;
        libs            ("libforces.so");
        patches         (canopy);
        rho             rhoInf;
        rhoInf          0.9568587862;
        CofR            (0 0 0);
        dragDir         (1 0 0);
        liftDir         (0 1 0);
        pitchAxis       (0 0 1);
        magUInf         70;
        lRef            11.18033989;
        Aref            98.17477042;
        writeControl    timeStep;
        writeInterval   20;
    }
}
